<?php
########################################################################
# IE Imaging Upload System
# Copyright (C)2008 IE Imaging
# info@ieimaging.com
########################################################################

// Header.php
$l_head3 = "Επιλογές";
$l_head5 = "Μεταμόρφωση Αρχειου";
$l_head6 = "Πληροφορίες PHP";
$l_head7 = "Τροποποιημένο php.ini";

// Options.php
$l_opt8 = "Μπορείτε να αλλάξετε τις επιλογής της εγκατάστασης του <b>Upload-Point</b> παρακάτω.";
$l_opt10 = "Μπορείτε να επισκεφθείτε ξανά την σελίδα για αλλαγές στις ρυθμίσεις.";
$l_opt11 = "Όνομα ιστότοπου και τιτλος σελίδας.";
$l_opt18 = "Προστασία με Κωδικό";
$l_opt19 = "Επιλογή για να χρησιμοποιήσετε την επιλογή για προστασία με κωδικό.";
$l_opt22 = "Ο κωδικός του διαχειριστή για την προστασία του πίνακα <b>Επιλογών </b>(options.php)";
$l_opt24 = "Ο κωδικός διαχειριστή για το <b>File Upload</b> (index.php).";
$l_opt25 = "Μεταμόρφωση Αρχείου";
$l_opt26 = "Είτε είναι είτε δεν είναι η \"File upload\" επιλογή διαθέσιμη. Ο κατάλογος \"File Upload\" θα δημιουργηθεί αυτόματα εάν δεν υπάρχει.";
$l_opt26a = "Δημιουργία αρχείου index καταλόγου File Upload.";
$l_opt26b = "Η επιλογή για δημιουργία Index αρχείου θα μπορεί είτε 1) να προβάλει όλα τα αρχεία σε ένα πιο κομψό τρόπο απο τον επιλεγμένο του server είτε 2) να κάνει ένα κατάλογο μή ορατό και να πρωθεί τον φυλλομετρητή στο όνομα domain. Εάν υπάρχει ήδη ένα αρχείο index η εφαρμογή αυτή δεν θα το διαγράψει.";
$l_opt26c = "Μη Ορατό ή Ορατό αρχείο index.";
$l_opt26d = "Διαγραφή αρχείου index του καταλόγου μεταμόρωσης.";
$l_opt26e = "ΠΡΟΣΟΧΗ!!! Αυτό θα διαγράψει όποιοδήποτε Index αρχείο υπάρχει στον κατάλογο μεταμόρφωσης αρχείων.";
$l_opt26f = "Ο αριθμός των αρχείων που θα προβάλονται σε κάθε σελίδα.";
$l_opt26g = "Επιλογή για απόκριψη της λίστας αρχείων στον συνδεδεμένο χρήστη.";
$l_opt26h = "File Upload :: Αρχεία Index";
$l_opt26i = "File Upload :: Περιορισμοί Χρηστών";
$l_opt26j = "Συνάρτηση Μετονομασίας Αρχείων.";
$l_opt26k = "Συνάρτηση Διαγραφής Αρχείων.";
$l_opt28 = "Ο κατάλογος μεταμόρφωσης αρχείων απο το όνομα domain. Αυτός ο κατάλογος θα δημιουργηθεί αυτόματα. Για παράδειγμα , εάν χρησιμοποιήσετε το \"http://YOURDOMAIN.com/testing/files/\", ο κατάλογος μεταμόρφωσης αρχείων θα είναι αντίστοιχα ο: \"testing/files\".";
$l_opt28a = " Αυτός ο κατάλογος θα δημιουργηθεί αυτόματα. Για παράδειγμα , εάν χρησιμοποιήσετε το
\"http://YOURDOMAIN.com/testing/files/\", ο κατάλογος μεταμόρφωσης αρχείων θα είναι αντίστοιχα ο: \"testing/files\".";
$l_opt29 = "Αρχεία που θα αγνοόυνται στον αποθηκευτικο χώρο.Το \".htaccess\" αγνοείται εξ ορισμού.";
$l_opt33 = "Ρυθμίσεις μεταμόρφωσης μεγέθους αρχείων</b> (php.ini)";
$l_opt33a = "Μεταμόρφωση Αρχείου :: PHP Μέγεθος Αρχείου";
$l_opt34 = "Οι περισσότεροι παροχείς αφήνουν τον χρήστη να δημιουργήσουν ένα τροποποιημένο αρχείο <b>php.ini</b>  για την παράκαμψη των προκαθορισμένων ρυθμίσεων του php.ini αρχείου. Αυτό είναι χρήσιμο εαν θέλετε να αυξήσετε το μέγεθος των αρχείων προς μεταμόρφωση. Το τροποποιημένο αρχείο <b>php.ini</b> περιέχει τις ακόλουθες γραμμές:<br /><b>file_uploads</b> = On<br /><b>post_max_size</b> = *M<br /><b>upload_max_filesize</b> = *M<br /><b>register_globals</b> = On/Off<br /><b>error_log = error_log</b><br /><b>error_reporting</b> = 2039<br /><b>log_errors</b> = On<br />Είναι χρήσιμο να συγκρίνετε τα καινούργια <b>\"PHP Info\"</b> αποτελέσματα με τα αρχικά
<b>\"PHP Info\"</b> αποτελέσματα και να κάνετε τις απαραίτητες προσθήκες για να ταιριάζουν με το αρχικό php.ini.$p2$p Σημείωση!!! Αυτό μπορεί να μην δουλεύει σε όλους τους παροχείς!!!";
$l_opt35 = "Δημιουργία \"php.ini\"";
$l_opt42 = "Βασικές Ρυθμίσεις";
$l_opt43 = "Ταχύτητα ανακατεύθυνσης για το index.php. 1000 = 1 second";
$l_opt44 = "ταχύτητα ανακατεύθυνσης για το options.php. 1000 = 1 second";
$l_opt104 = "Να μην αλλάξετε τις παρακάτω επιλογές (εκτός και αν ξέρετε τι κάνετε)";
$l_opt105 = "<b>Header</b> Εάν θέλετε να χρησιμοποιήσετε κάποιο header/footer.";
$l_opt106 = "<b>Κατάλογος Εφαρμογής</b> Για παράδειγμα αν η εγκατάσταση είναι στο \"http://YOURDOMAIN.com/testing/upload\", τότε \"<b>Κατάλογος Εφαρμογής</b> = testing/upload\".";
$l_opt109 = "<b>Κατάλογος Αρχείων</b> Εκεί που τα αρχεία με τους κωδικούς δημιουργούνται απο την εφαρμογή και αποθηκεύονται. Μην τα αλλάξετε εκτός και αν αλλάξετε χειροκίνητα την διαδρομή ή το όνομα του φακέλου \"data\" .";
$l_opt110 = "<b>Διαδρομή Εφαρμογής</b> Απο την διαδρομή του εκτελέσιμου στην διαδρομή του ιστότοπου.";
$l_opt111 = "<b>Html start tag</b> Αυτά χρησιμοποιούνται μόνο για Upload-Point script σελίδες.";
$l_opt112 = "<b>Html end tag</b>";
$l_opt113 = "Τροποποίηση των ρυθμίσεων";
$l_opt114 = "Οι ρυθμίσεις σας <b><i>αποθηκεύτηκαν με επιτυχία</i></b>.";
$l_opt116 = "Language/Sprache/Lengua/Γλώσσες/Taal/Dil/语言";
$l_opt117 = "English";
$l_opt118 = "Deutsch";
$l_opt119 = "Espa&ntilde;ol";
$l_opt119a = "Nederlands";
$l_opt119b = "简体中文";
$l_opt119c = "Türkçe";
$l_opt119d = "Ελληνικά";
$l_opt121 ="έχει δημιουργηθεί και τα δικαιώματα έχουν αλλάξει σε";
$l_opt123 ="Υπήρξε ένα πρόβλημα και το  <b>$fileupload_dir_name</b> δεν έχει δημιουργηθεί.";
$l_opt128 = "επαναφορά";
$l_opt133 = "Ορατό";
$l_opt134 = "Μη ορατό";

// Setup.php
$l_set17 = "Μέγιστο μέγεθος αρχείου μεταμόρφωσης. Για παράδειγμα: 55M";
$l_set18 = "Register Globals, ενεργές/μή ενεργές";
$l_set19 = "Δημιουργία";
$l_set20 = "<b>Το PHP.INI</b> δημιουργήθηκε!!!";
$l_set21 = "Αυτόματο κλείσιμο...";
$l_set22 = "<b>ΥΠΗΡΞΕ ΕΝΑ ΠΡΟΒΛΗΜΑ!!!</b>το php.ini δεν δημιουργήθηκε!!!";

// Upload.php
$l_upload1 = "Μεταμόρφωση Αρχείου";
$l_upload2 = "Τα αρχεία μου";
$l_upload3 = "Όνομα";
$l_upload4 = "Μέγεθος";
$l_upload5 = "Τροποποιημένο";
$l_upload6 = "Μετονομασία";
$l_upload7 = "Διαγραφή";
$l_upload8 = "Θέση";
$l_upload11 = "Κατάλογος αρχείων δεν υπάρχει και δεν ήταν δυνατή η δημιουργία!!!";
$l_upload12 = "η αλλαγή δικαιωμάτων σε 755 απέτυχε!!!";
$l_upload13 = "Επιτυχής μεταμόρφωση.";
$l_upload14 = "Υπήρξε ένα πρόβλημα στην μεταμόρφωση του αρχείου.";
$l_upload15 = "Αυτόματη προώθηση στην  <a href=\"index.php\">σελίδα μεταμόρφωσης αρχείων.</a>";
$l_upload18 = "<b> διαγράφηκε με επιτυχία </b>.";
$l_upload19 = "Δεν ήταν δυνατή η μετονομασία του αρχείου";
$l_upload20 = "<b>μετονομάστηκε με επιτυχία</b> σε";
$l_upload21 = "Μεταμόρφωση, παρακαλώ περιμένετε...";

// Global
$l_global5 = "Ακύρωση";
$l_global7 = "Ενεργό";
$l_global8 = "Μη ενεργό";
$l_global10 = "Επιτυχής Αποσύνδεση";
$l_global11 = "Αυτόματη Προώθηση...";
$l_global12 = "Αποσύνδεση";
$l_global13 = "Εισαγωγή Κωδικού";
$l_global14 = "Έισοδος Χρήστη";
$l_global17 = "Ναι";
$l_global18 = "Όχι";
?>